app/controllers/mais_usuarios_controller.rb

  def index
	#@usuarios = Usuario.find([1, 3])
	#@usuarios = Usuario.find([params[:id], (params[:id] + 10)])
	#@usuarios = Usuario.all
	@usuarios = Usuario.where("id > 6")
---
SELECT `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` IN (5, 10)