app/controllers/usuarios_controller.rb

SELECT `usuarios`.* FROM `usuarios`
SELECT COUNT(*) FROM `usuarios`
---
  def index
    @ultimoUsuario = Usuario.limit(8).last
    @usuarios = Usuario.limit(8)
	@quantidadeUsusarios = Usuario.all.count

INSERT INTO `usuarios` (`nome`, `email`, `sexo`, `nascimento`) VALUES ('teste', 'maria@hotmail.com', 'm', '2015-11-11')
---
  def create
    @usuario = Usuario.new(usuario_params)

    respond_to do |format|
      if @usuario.save

UPDATE `usuarios` SET `nome` = 'felipe', `nascimento` = '1989-12-07' WHERE `usuarios`.`id` = 1
---
  def update
    respond_to do |format|
      if @usuario.update(usuario_params)

DELETE FROM `usuarios` WHERE `usuarios`.`id` = 4
---
  def destroy
    @usuario.destroy

SELECT  `usuarios`.* FROM `usuarios` WHERE `usuarios`.`id` = 4 LIMIT 1
---
    def set_usuario
      @usuario = Usuario.find(params[:id])